["What a solid show! What are your thoughts? Who was best dressed? The winners? The hosts? I want to hear what you think! Golden Globes", "I say this every year but holy fuck are those award shows predictable. goldenglobes", "So far Bradley Cooper in Tom Ford is the best-dressed on the red carpet... goldenglobes", "My best dressed go to.. *Eva Longoria *Amy Adams *Naomi Watts *Amanda Seyfried Golden Globes", "Who is the best dressed at the Golden Globes? My pick is Jessica Alba", "Jennifer Lawrence is dressed like she's about to give a flu shot. Golden Globes", "Les Miserables: also best-dressed cast? lookingfab goldenglobes", "What's your verdict on E News presenter Giuliana Rancic's Oriett Domenech dress? goldenglobes", "J-Lo, you are pretty, but the floating lace dress feels a bit overzealous for these awards. Golden Globes", "OMG - Amaze. Salma Hayek in Gucci via usweekly Golden Globes fashion bestdressed", "And the Golden Globe for supermodel killing it in that dress goes to Miranda =) \" Miranda Kerr goldenglobes instyle \"", "I'm happy for Ben Affleck. Also he knows to talk like he's on an Aaron Sorkin show when giving a speech to fit everything in. Golden Globes", "Kate Hudson, Nicole Kidman, Jessica alba, and I hate to say it... J Lo bestdressed goldenglobes", "First time I'm laughing at Will Farrell since The Producers. I'm sure credit goes to Kristen Wiig. Golden Globes", "The best part about the goldenglobes is the best and worst dressed list.", ". lenadunham WIIIIIIIIIIINS! PS--love the detailing on your dress! goaheadgirl Golden Globes Girls HBO is the best.", "Rachel Zoe who all did you dress for tonights Golden Globes? Missed all the pre awards show shows?", "Eva & Kerry best dressed tonight goldenglobes", "Congrats to PF Tompkins! A real honor to be covered by Adele. Golden Globes", "Can J Lo just present all the rest of the awards tonight no one can follow her and that dress!! Golden Globes", "Ginger got the award!! loveredheads Golden Globes", "mdsams: Is the perpetually scared gorilla trainer from Congo accepting award for Argo? goldenglobes", "Same dress, different award show- so predictable! Is Jennifer Lopez wearing a figure skating costume? Golden Globes", "Happy for Ben Affleck but will never forgive him or his lovely wife for what they did to Daredevil and Electra. goldenglobes argo", "Having just seen Zero Dark Thirty today, Jessica Chastain is incredible in it. Very well-deserved award. Golden Globes", "Naomi Watts and Jessica Chastain.. One of them will take the award as \"Best Actress\". *my prediction Golden Globes 2013", "J Lo's dress deserves SOME kind of award Golden Globes", "If Leo doesn't win an award tonight ill throw a hissy fit goldenglobes", "SPOILER ALERT! Congrats, Adele! You really honored the Bond song legend. :-) & congrats on a mums night out! goldenglobes", "We've got the best pics from the Golden Globes red carpet that you won't see anywhere else! Come see!", "The red carpet. I walked on it.", "Okay best dressed Golden Globes amypoehler in her suit jessicaalba loved the bling and Kate Hudson's plunging neckline", "Lucy Liu gets my unique award on the redcarpet at the goldenglobes - there were dresses I liked better but she looked uniquely beautiful!", "Perez Hilton: Kate Hudson was also one of my best dressed at the Golden Globes!!!", "John Ham's penis for best dressed Golden Globes redcarpet", "Latinas stun on red carpet, presenting on stage at Golden Globes latism", "If you take away anything from this Golden Globes show let it be that I could be Lena Dunham's body double. Golden G Iobes honored", "Wow Jessica Alba, just wow. bestdressed goldenglobes", "AGREE! Kristin & Will must host next year. Must. Bring on Fred Armisen as special guest. Can't wait! goldenglobes", "Globes Insider Backstage: Anne Hathaway tells the press she's honored to be here, as well as Oscar-nominated. Golden Globes Les Mis", "I agree. RT bellastyles Ok Eva Longoria and J. Lo are up for best dressed too tonite Golden Globes", "Make sure you've seen all of our best dressed from tonight's Golden Globes", ". eonline This is what I'll be wearing during The Golden Globes. Does this finally get me on your best dressed list?", "J Lo rules dressing for awards ceremonies. Everyone else just bows to her. Golden Globes", "Currently loving the fact that my mom is sending me updates about the award winners and best dressed at the Golden Globes via text message.", "Who's your bestdressed for the goldenglobes tonight?", "Overall faves tonight: Kerry Washington, Anne Hathaway, Amanda Seyfried, Michelle Dockery. Who was your best dressed?? Golden Globes", "Life of Pi - Best original score goldenglobes...award should also go to J.lo's dress", "End thoughts: Internet has odd hatred for adorbs Anne Hathaway, I no longer watch the best TV shows apparently, women=awesome goldenglobes", "Ang Lee is nominated for The Life Of Pi--which is what I'm gonna call the six weeks after I take this dress off!", "Final Tally: Argo wins big, Jodie goes long, Amy and Tina KILL, P Diddy just figured out these weren't the BET awards. goldenglobes", "Jodie Foster is giving not a single red velvet fucks tonight. Golden Globes", "Golden Globes hosts Tina Fey, Amy Poehler show off matching \"husband and wife\" outfits on red carpet", "I think Kate Hudson has it for bestdressed, with Emily Blunt in a close second. Love both their looks tonight! goldenglobes", "I can't focus on any of the nominees bc Giuliana looks like the bride of Frankenstein Golden Globes redcarpet", "Browsing thru goldenglobes red carpet, picking my own best&worst dressed", "If you have so much money why would you wear such an ugly dress to an awards show?! Golden Globes Disappointed", "Blinded by Kerry Washington's Miu Miu dress and her gorgeous bling. We are in LOVE. Golden Globes bestdressed", "\"Brave\" Golden Globes win for best animated picture is so well deserved. Saw it 5 times in theater with my daughter & never tired of it", "Delectably Chic goldenglobes Surprised, but nice to see that this award season wasn't THAT predictable too.", "Cody Zeller walking the red carpet at the Golden Globes, nominated tonight for one of his many magnificent flopping jobs.", "Julianne Moore and Kate Hudson are my best dressed of the night. Golden Globes", "4th nomination and 4th win for Claire Danes! Incredible! Golden Globes", "Les Miserables is a book written by Victor Hugo. He deserves to be given credit as well. Just Saying Golden Globes", "Taylor Swift is my pick for best dressed at the Golden Globes. Make your picks in eonline's Pose-Off! eredcarpet", "Check out all the stars in our Golden Globes arrivals gallery! Who do you think is the best dressed?! eredcarpet", "Jennifer Lopez is definitely the best dressed tonight. Golden Globes", "I think Jessica Alba may be my favorite for best dressed. Wow Golden Globes", "Golden Globes Kate Hudson, Nicole R the best dresses so far :)", "Golden Globes: 'Les Miz' 'Argo' and 'Girls' win big; Jodie Foster honored - Chicago Tribune", "The red carpet arrivals are winding down fast. Who were your bests and worsts? Golden Globes", "Tina and Amy At Golden Globes -- funniest, best opening of any awards show in recent memory", "I haven't watched the Golden Globes since they totally ignored 'Saved By The Bell : Hawaiian Style' Maybe one of the best films ever.", "Can Tina and Amy host the Golden Globes every year? Classy, funny, witty, inspired and succinct.", "Jennifer Lawrence wins best dress. I hope she wins for Best Supporting Actress in Silver Linings Playbook too! goldenglobes", "Lea Michele, Taylor Swift, Kate Hudson, Kristen Bell and Katherine Mc Phee are by far the best dressed of the night! Golden Globes", "Word on the street is that J. Lo and J. Hud are giving Halle Berry a run for her money on the red carpet.... Golden Globes Red Carpet.", "Behind the glitz and glamour of the films and TV shows nominated for Golden Globes are incredible teams of...", "My pick for best dressed: Jessica Alba! Stunning as always. goldenglobes", "Kate Hudson Favorite goldenglobes bestdress fashion", "Dustin Hoffman & his wife are giving me cavities adorbs Golden Globes redcarpet", "Daniel Day-Lewis DESERVES that award. His performance in Lincoln was nothing short of incredible. Golden Globes", "Seriously everyone and everything looked fabulous tonight!!! Golden Globes awards beautifuldresses", "I'm gonna be controversial in saying this, but I'm voting Kate Hudson best dressed. goldenglobes", "I like Tina Fey It's our hosts Tina Fey and Amy Poehler! goldenglobes redcarpet", "I must say Hands Down Jennifer Lopez was the best dressed the goldenglobes in Zuhair Murad.....I know di", "Thank you to the Hollywood Foreign Press. Check tomorrow for party pics, best dressed and more. Golden Globes", "Well at least Anne Hathaway honored Sally Field as the true legend she is... She totally should have won for Lincoln Golden Globes", "Thanks for joining us! Top 10 best & worst dressed tomorrow on Golden Globes", "The best journeys are always shared.", "GOLDEN GLOBE CLASSICS: Marilyn Monroe on the red carpet of 1962 Golden Globes where she received an honorary award.", "My top 3 best dressed men at the goldenglobes were Daniel Craig. George Clooney and Ryan Seacrest. Cheers.", "the red carpet golden globes award.....live", "Let's be real... I only watch the Golden Globes to see all the dresses! awardshowfashion", "kerrywashington 's dress is everything!!! Golden Globes awards", "I haven't watched the Golden Globes since they totally ignored 'Saved By The Bell : Hawaiian Style' Maybe one of the best films ever.", "2 best dressed: Tina Fey and Amy Poehler realtalk Golden Globes", "Jennifer Lawrence giving a wave on the red carpet Golden Globes", "Half smiles, fake claps, blank stares, jealousy, envy, awkward convos, best dressed, make up, plastic surgery. Award Season Golden Globes", "Jodie Foster- incredible inspiration for women. We honor your privacy and Congratulations on the Cecil B. De Mille award. Golden Globes", "Suddenly remembered it was the golden globes!! Rlly want les mis to get a couple awards!! excited", "yaylauramarano You are incredibly gorgeous laura inside and out! I cannot wait until you receive your own golden globes *cries", "More redhead love at the Golden Globes--Brave wins best animated. cc: Wmag Will", "15 best-dressed celebs on Golden Globes red carpet via todayshow I AM OVER THIS HAIR COLOR.", "My best dressed Golden Globes Jessica Alba, Nicole Richie, Nicole Kidman and Lucy Liu", "Tune in: Live Chat: Golden Globes 2013: From the red carpet to the hosts to the show - \"", "She Wired: A montage of sex scenes with men during Jodie Foster's De Mille presentation? We get it; she has range. goldenglobes - KE", "Love jessicaalba in her orange. Stunning. Who's your pick for bestdressed at the Golden Globes so far?", "My top 2 pick for best dress Jennifer Garner & Amy Adams!! simply the darlings of the nite.. Fashion Police Golden Globes", "Who do you think is the *best dressed* at the Golden Globes?", "Happy for Ben Affleck but will never forgive him or his lovely wife for what they did to Daredevil and Electra. goldenglobes argo", "Was just thinking that the dresses at these awards haven't been that bad. Then, Lucy Liu. goldenglobes", "Batman presented Daredevil's wife Elektra to give Wolverine a Golden Globe. A nerd definitely made that happen. Golden Globes", "MT goldenglobes: No...Ben says that he's happy that Argo is being honored collectively. For Ben Affleck Do you feel \"snubbed\" by Oscars", "Kate Hudson is my best dressed nominee! Golden Globes", "Jennifer Lawrence!!! The ONLY award I cared about. You rock, girl. Golden Globes", "zarafs I thought Matt Le Blanc's nomination was how they honored her. Golden Globes", "How credible are the Golden Globes when Sons Of Anarchy isn't even nominated? sutterink Sonsof Anarchy SOAFX", "Jessica Alba is red carpet award worthy in her coral-hued Oscar de la Renta gown. Golden Globes", "Recent ASOS cover-girl Clare Danes in popping red, congratulations on taking out best actress! Golden Globes", "Lea was the best dressed E Red Carpet Golden Globes please <3", "Someone tell me why there is an award for foreign films when the Golden Globes is only aired in America lol", "Hey! Wolverine won an award! I am reminded of this \"Les Mis\" review someone shared with me on FB: Golden Globes", "Yah idk whats really going on with the golden globes but if Leo doesnt win best male actor in a predominantly gay role, then there is no god", "This is the kinda of thank you speech I'd give. excited unprepared spazz benaffleck goldenglobes", "I'm giving up. Just too damn tired now. But it was fun so far. Catching up on youtube tomorrow. Golden Globes", "Best outfit of the night goes to Tina Fey Golden Globes", "I wish I was famous so I could dress up all fancy and go to the golden globes and other award shows", "Claire Danes, Anne Hathaway, Jennifer Lawrence, and all the best dressed at the 2013 Golden Globes", "Am I the only one having a difficult time picking who the best dressed woman was at the golden globes because there arent a lot of choices?", "Kate Hudson & Michelle Dockery for best dressed goldenglobes idontwatchijustlurkoutfits", "The best dressed Kate hudson. Golden Globes awards", "I feel like J Lo wore that nude beadwork dress at another awards show, but I can't place it. Golden Globes Recycled Fashion Oh This Old Thing?", "And Homeland takes it too. Such an incredible show (although I'd give it to Sonsof Anarchy). Golden Globes", "After watching Jennifer Lawrence accept her award I have to say that she's the bestdressed at the Golden Globes", "Chomps The Cat is in all her best for the red carpet. rolling on it and trying to eat it. Golden Globes", "Best Motion Picture Drama goes to ARGO! I am so incredibly happy! This is my favorite movie of the last year of movies! Golden Globes", "Why is it in the Golden Globes and Academy Awards people only care about dresses? Does no one give a hoot about a suit?", "june Ambrose yes I so agree. If you had to pick one best dress for the night who would it be? goldenglobes E Red Carpet", "Okay, Golden Globes is finito. Time to look at who gets the coveted prize of Golden Globes bestdressed!", "The Latinas are taking over the best dressed category this year goldenglobes", "Wooo Brave won an award, no ones getting fired at Pixar yet. Golden Globes", "Favorite looks at the Golden Globes are Katharine Mc Phee, Lucy Liu, Julianne Hough and Kate Hudson bestdressedpicks", "Check out our gallery of all the red carpet looks at the Golden Globes - who do you think is the best dressed?", "I mean...she is just spectacular. goldenglobes bestdressed", "my best dressed picks Emily Blunt, Claire Danes, Jessica Chastain, Julianne Moore. Tina fey also looks amazing Golden Globes", "Kate Hudson's dress at Golden Globes is the best *u*", "So excited and honored to be presenting at the Golden Globes this year!! Golden Globes", "Hey, can we add on another sip for every host outfit change? Golden Globes", "I love how the HFPA's random nomination attempt to get Meryl Streep in the room totally backfired. goldenglobes", "Halle Berry, this isn't the MTV awards!! Change your dress! goldenglobes", "The End. Roll credits. The Golden Globes are nominated for an Emmy for best variety show.", "As I have predicted already, it's Williams vs Danna for best score goldenglobes Oscars", "As predicted Jessica and Jennifer both won best actress in both categories, now its Oscar race between two Golden Globes", "Yay Claire Danes! feel bad for Michelle Dockery, but she was one of the best dressed people tonight. Golden Globes", "Sophia Vergara looked absolutely amazing bestdressed beautiful obsessed Golden Globes redcarpet", "If the Golden Globes are any \"predictor\" or \"measurement\" of the Oscars. It could be the wildest Oscars yet! movieawards", "Hahahaha these people that Amy and Tina are dressing up like. Give them the awards. Golden Globes", "dhawk 1984 who is best dressed at golden globes", "Julianne Moore in Tom Ford is easily the best dressed..but I love Marion Cotillard in Raf Simons for Dior Golden Globes fashion", "Al Roker poops his pants and gets to host the red carpet at the golden globes, I poop mine and get kicked out of the cinema Golden Globes", "Julianne Moore may be at the top of my best dressed list Golden Globes", "Perez Hilton: Kate Hudson was also one of my best dressed at the Golden Globes!!!", "Hey Jodi Foster...no one asked you to give up your privacy to be such rich and adored. Go sit down. goldenglobes", "My best dressed at the Golden Globes Nicole Kidman, Lea Michele, Miranda Kerr, Kate Hudson & Claire Danes.", "->RT Above Average A: Tina Fey & Amy Poehler were really good hosting the Golden Globes...well when they appeared. They needed more air time.", "And it gives her a droopy boob. That is such a ho dress. goldenglobes", "Ok! I'm looking at the Golden Globes red carpet! CLEARLY J Lo is the best dressed!!!!", "Damian Lewis representando a raca ruiva. goredheads Golden Globes", "In honor of great movies past, Lucy Liu channeled Vivien Leigh in Gone With The Wind by wearing a dress made of curtains to the Golden Globes", "Claire Danes gives new meaning to the word \"intense\". I am a helpless princess compared to her. Golden Globes", "Ashley Mc Govern Golden Globes hosts Tina Fey, Amy Poehler show off matching \"husband and wife\" outfits on red carpet", "Christoph Waltz winning best supporting actor is great. Would've preferred Leo, but Waltz is a worthy alternate choice. Golden Globes", "Taylor Swift with the best dress! Her style is so beautiful! Golden Globes", "Claire Danes, Anne Hathaway, Jennifer Lawrence, and all the best dressed at the 2013 Golden Globes", "Plus Daredevil & Elektra RT Digital LA So awesome Wolverine, Iron Man, Batman, Catwoman & even Hawkeye are presenting/winning Golden Globes", "My top 4 best dressed of the Golden Globes. Christian Dior Miu Miu Chanel Alexander Mcqueen", "This is going to be fun because i have zero clue who is nominated for anything Golden Globes Cant Make Predictions Going To Anyway", "Ang Lee was nominated for 'Life of Pi,' which is what I call the 6 weeks after I take this dress off.", "In my best Miranda Priestly voice: Jennifer this dress... Not very special. M* Golden Globes", "Golden Globes best dressed: Zooey Deschanel was a lady in red in an Oscar de la Renta gown Oscar PR Girl Zooey Deschanel", "I've got Claire Danes, Lucy Liu, & Hugh Jackman for best dressed! goldenglobes", "That awkward moment when your ex comes out to present right after your movie was honored Benifer Golden Globes", "Surprise surprise jessicaalba is my pick for best dressed. Perfect glamour. Golden Globes", "bestdressed Jessica Alba STUNNING hair, makeup, dress and jewels! goldenglobes", "Life of Pi was visually incredible and should have won that award. goldenglobes", "Was Allison Williams the best dressed Girls star? FYI She's wearing J.Mendel: goldenglobes", "goldenglobes awards are giving me good prom dress ideas", "Jodi Foster .. Is an amazing actress .. Hands down truly deserved to be honored on the Golden Globes! So happy for her!", "Who is your best dressed so far on the red carpet? goldenglobes", ". kerrywashington is totally killing it. Gorgeous Miu Miu dress + vintage movado! bestdressed goldenglobes", "And the Golden Globe goes to... Les Miseredkjdknfweo.", "My picks for best dressed: Michelle Dockery, Katharine Mc Phee, Adele and Amanda Seyfried. Golden Globes E Red Carpet", "Emily Blunt for best dressed at the Globes Golden Globes Fashion Police", "benaffleck yes! Win them all sometimes it is better to be honored by the hollywood foriegn press than it is the academy. goldenglobes", "\"Something about the best umm\" - Salma Hayek!! Bahahaha goldenglobes", "Michelle Dockery looks stunning in her beautiful dress, best of the night goldenglobes", "So far I have done a horrible job predicting these awards, was hoping Downton Abbey would get Best TV Series- Drama! Golden Globes", "Love Tina Fey's dress! & I love that her & Amy Poehler are hosting. goldenglobes", "Ladies and gents, we have our Golden Globes best dressed! Vote for your pick here:", "there's no fun in this award show without red carpet pics... hopefully they present? do they show trailers at the golden globes?", "Daniel Day-Lewis DESERVES that award. His performance in Lincoln was nothing short of incredible. Golden Globes", "Seriously! People are actually watching Golden Globes? Refuse to give any credence to Hollywood IN ANY WAY", "See all the best (and worst) red carpet dresses at the Golden Globes!", "Photo: electricpussycat: Yoshiki at the Golden Globes being a candidate for best dressed dude (for those...", "Was Halle Berry's dress used to clean up gabriel Aubrey's face after the thanksgiving brawl? Golden Globes", "No Golden Globes for me tonight :( keep me updated on the best and worst dressed! Oh and also who wins awards...", "Our best-dressed Golden Globes redcarpet story is up. See who made the cut:", "juliannehough and taylorswift 13 are 2 of my best dressed yet again! Golden Globes Peoples Globes", "melissagorga: Who's your best dressed?!! Mine is katehudson", "People at the golden globes must get so tired of clapping after every nominee.", "and the most boring acceptance speech award goes to ... goldenglobes whoboredusmore", "Lol!! goldenglobes best dressed: kate hudson in alexander mcqueen and worst (cont)", "Eva Longoria is the best dressed at the Golden Globes she looks gorgeous !x", "I better have more of these predictions right... Lol. I was off on best supporting actor Golden Globes", "I can't pick the best dressed. Everyone looks amazing! Golden Globes", "Taylor Armstrong: Who watched the red carpet coverage of the Golden Globes? Who do you think was best dressed?", "Surprise fitting with one of my favorite people and best friend austinstowell Golden Globes party dapper menswear fashion", "Dudes. Jodie Foster won THE award for actors, came out of the closet, retired from acting & riffed on privacy/Honey Boo Boo. Golden Globes", "Mario Lopez Extra you're snubbing Kate Hudson!!! Best dressed in my book!! goldenglobes bestdressed", "Lucy Liu just stole the show in Carolina Herrera and amazing hair! bestdressed redcarpet goldenglobes", "In honor of the Golden Globes...here i am dressed up on my GQ Cover...my fake fan made GQ Cover", "Debra Messing is my pick for best dressed at the Golden Globes. Make your picks in eonline's Pose-Off! eredcarpet", "Most beautiful/best dressed woman of the night! katharinemcphee goldenglobes woman katharinemcphee dres", "feeling inspired after the Golden Globes!! Love awards season!!! :) :) :)", "Some of the dresses are breathtaking, can't wait until they start awarding! Get Glue goldenglobes", "My top 3 picks for best dressed! goldenglobes", "Photo: I must say Hands Down Jennifer Lopez was the best dressed the goldenglobes in Zuhair Murad.....I...", "Why is EVERY nominee or presenter featured in EVERY ad? Is this on purpose? Because stop. Golden Globes", "What dress malfunction will Sofia Vergara post on Instagram this awards show?! GG Golden Globes jennykoreny barbiep niecie 797 mini mo", "witnessing an incredibly boring song win an award", "She's a redcarpet and a award fashionista/Diva (y) Jennifer Lopez always flawless at GOLDENGLOBES", "Fav goldenglobes moment so far: Daniel Craig giving Adele a high five. Least fav: obnoxious crowd in the background of the red carpet.", "My top 3 Golden Globes best dressed: Julianne Moore, Naomi Watts and Kerry Washington. Who made your list? goldenglobes", "\" NYD Ngossip: This monologue is beyond incredible. Can Tina Fey and Amy Poehler host everything, please? goldenglobes\" I second that!!", "Tina Fey dressed up as nominees that didn't show up is epic!! Golden Globes", "Are you watching the Golden Globes? Who do you think is best dressed??", "Who's won best dressed tonight?! So many amaze dresses this year - Tweet us your picks! Golden Globes", "Golden Globes bestdressed 5) Sienna Miller. Kudos to her for wearing a unique number from original Canadian, Erdem.", "awh love how much credit hugh hackman gives his wife. goldenglobes", "Maggie Smith just can't be bothered to attend an award show. Golden Globes", "i think my best dressed at the Golden Globes tonight is Lucy Liu... girl worked it", "quite a difference of the wardrobe at the goldenglobes compared to mtv music awards or even the grammys", "annehathaway in Chanel = AMAZING! So far best dressed! eredcarpet Golden Globes Carpet goldenglobes", "Golden Globes best dressed: Which Les Mis gal do you like? Anne Hathaway in Chanel or Amanda Seyfried in Givenchy", "Golden Globes: 'Les Miz' 'Argo' and 'Girls' win big; Jodie Foster honored - Chicago Tribune", "Wooo Hoo go Anne Hathaway best supporting actress!!! Lovin the dress too!!! Golden Globes", "Wait, has Jodie Foster been in anything since Contact? What is she being honored for? goldenglobes", "Can't wait to see the \"Who Wore It Best\" column for the Golden Globes. Or more aptly named, who wore the best center cutaway dress.", "goldenglobes best dressed: kate hudson in alexander mcqueen & worst dressed: halle berry in a candy wrapper from forever 21", "bestdressed at the goldenglobes: The chick from the Hunger Games & Jessica Alba", "My Golden Globes predictions: People will agree or disagree with the choices. The hosts will be above or below expectations.", "Trending tonight: Light pink, nude, white and red... Which color is your favorite & who wore it best? Golden Globes", "I wish I was famous just so I could dress up for every award show goldenglobes", "Julian Moore....best dressed so far Eredcarpet goldenglobes", "Congrats to Claire Danes! She won Best Actress in a TV Series Drama (and probably many best dressed lists!) Golden Globes", "But for me the best.drees on red carpet in Goldenglobes its Naomi Watts! I love her dress!", "Let's focus on the Chandelier for the closing credits Golden Globes hollowoodawardshowsarestupid", "Heidi Klum, Anne Hathaway, Helen Mirren and Julian Moore!! The best dressed!! goldenglobes", "Ben Affleck won two awards tonight - best director and best presenter-wife. Jennifer Garner is ravishing in red! goldenglobes", "Golden Globes as long as movies that glorify violence keep getting honored, violence- gun included will never go away- Django", "Oh dearie! That was a speech that would be remembered for a long time! & one of the best speeches I've ever heard!Bravo Jodie! Golden Globes", "Way to hard to pick best dressed for Golden Globes tonight! Everyone looked beautiful! Can't wait to watch Fashion Police 2morrow on E News", "Anne Hathaway won Golden Globes Best Supporting Actress for Les Miserables. I would've given it to her for the Catwoman outfit alone.", "Well there it is Argo soars and Lincoln is sore, what a night! Golden Globes. Predicted 10-4 awards correctly!", "Helena Bonham Carter dress code to every award: The War of The Witches. Golden Globes", "Anne Hathaway = new Golden Globes love. Tribute to Sally Field + not giving Matt Lauer death glare on red carpet = class cc: serenabwoods", "Poor J. Lo. Every time she gets dressed for an awards show she has to try to top THAT dress...she came close this time Golden Globes", "So far I am loving Lucy Liu's Carolina Herrera gown dramatic goldenglobes bestdressed", "Golden Globes 2013 Live Chat: Photos, commentary and more from the red carpet to the hosts to the show", "So does Bill just get hired for appearances now? What's the running cost because I'm hosting a party in my dorm next week... goldenglobes", "Can Tina and Amy host the Golden Globes every year? Classy, funny, witty, inspired and succinct.", "Take THAT Hilary Swank. At least someone remembered to thank him during an awards speech... Golden Globes chadlowe", "Need to watch the goldenglobes now, but I gotta start off with the red carpet so I can see who is best dressed.", "Jessica alba = stunning and best outfit yet Golden Globes", "Speaking of red carpets, Jessica Chastain and Amy Adams both deserve awards tonight. dirtyjoke goldenglobes", "okay. they planned that. bigdressaward Golden Globes", "From Claire Danes to Jessica Chastain, see the best dressed on the red carpet at the 2013 Golden Globe Awards", "Golden Globes Worst Dressed 10)Tina Fey.This host's L'Wren Scott was not the dress for the leading lady of the night.", "The best and worst dressed of the 2013 Golden Globes", "I am so tired of Homeland and Modern Family dominating award shows. Even if good, there is a lot of good shit on telly Golden Globes", "Lea Michele is definitely on my list for best dressed tonight goldenglobes", "Adele makes her first red carpet appearance since giving birth in October. The star stuns in Burberry: Golden Globes", "WOW J Lo at the goldenglobes that dress is to die for! bestdressed Eva Longoria always looks amazing! Love the lace&back cut out! fashion", "Welp that's a wrap! Make sure to check out our best dressed post in the AM <3 goldenglobes", "How much more exciting would the Golden Globes red carpet be if the best-actor nominees were all growing out Oscar playoff beards?", "RT ghost 217 \"I love living in a world where Daredevil married Electra and had kids... Golden Globes\" <---- THIS.", "Um, Tina & Amy dressed as fake nominees is the best thing ever. Golden Globes", "Tina Fey & Amy Poehler were really good hosting the Golden Globes...well when they appeared. They needed more air time.", "I'm 16-8 with one more award, Motion Picture Drama, my prediction is Lincoln, but Argo is right there. Golden Globes", "May the odds be ever in your favor.", "itsrawrrawr i prepared by dvr ing every before show and the actual awards show igottathingfor goldenglobes", "Don't want to brag, but Mis Pelis featured many of the nominees tonight on the Golden Globes. goldenglobes", "Chocolate, leaky boobs and push-up competitions: the best of Golden Globes red carpet People Globes", "Kate Hudson looks SEXY! And I love her dress if not my favorite look one of the best definitely Golden Globes", "Was that the first time an award-winner thanked someone for \"letting out my pants\"? goldenglobes goclairedanes", "Huge thanks goes to tommyhilfiger for dressing Ricky Berens and I so well for the golden globes!", "Why is it in the Golden Globes and Academy Awards people only care about dresses? Does no one give a hoot about a suit?", "Jodie Foster is a strong, independent, extremely intelligent woman. I always admired her. Congrats on your award! Golden Globes", "Jodie Foster is honored with the Lifetime Achievement Award! golden Globes credittalkusa CTUSA", "Kayla Knapp FOX: Jennifer Lawrence!!! The ONLY award I cared about. You rock, girl. Golden Globes", "Don't know why the others bothered showing up, this was always Anne's award. Golden Globes", "Mermaid dresses are trending at the Golden Globes tonight! Who looks the best? mtvstyle", "Perez Hilton: Kate Hudson was also one of my best dressed at the Golden Globes!!!", "Jodie Foster is honored with the Lifetime Achievement Award! ET has all the Globes coverage", "fashionfinderz marioncotillard Golden Globes bestdressed", "Jodie Foster is giving not a single red velvet fucks tonight. Golden Globes", "Let's give an award to Eva Longoria for dressing slutty. Golden Globes", "Watching impossibly beautiful and fit people accept awards while I lounge on the couch shoveling snack food into my mouth. goldenglobes", "the best thing about the golden globes is pretty ladies in pretty dresses", "I'm not sure why I bother watching the Golden Globes because I'm not cultured enough to even know who or what half the nominees are.", "Jessica Alba Golden Globes best dressed nominee for sure!! hot e Fashion Police", "Bill Clinton is at the Golden Globes right now presenting an award...and scanning the crowd for a blue dress to aim on...", "My pick for best dressed was Kate Hudson! Who was yours? Golden Globes", "Brilliant! Amy Poehler pops up in Golden Globes crowd as a red-headed, big-teethed nominee", "Homeland winning any award shows how credible the Golden Globes are. Terribly over rated. HBO > Showtime", "designedwithlove's photo bestdressed goldenglobes redcarpet", "kerrywashington best dressed! So beautiful!!!! goldenglobes", "Two redheads just won awards, suck on that! Aye-yiyiyiyiyiyiyi! Golden Globes Ginger Pride", "Michelle Dockery of Downton Abbey: my vote for best dressed at the goldenglobes. What do YOU think?", "Least favorite dress was Kristen Bell. My boys said that Lucy Liu's flowered dress will win worst dressed award. Golden Globes", "Best dressed so far is Julianna Margulies, Jessica Alba, Nicole Ritchie & Ne Ne Leakes. Golden Globes bestdressed eonline Miss Kelly O", "So far my best dressed: Cottilard, Baccarin, Blunt, Danes, Weisz, Watts, Kidman. goldenglobes", "Are you paying attention to the Golden Globes red carpet? Pick your favs and get ready to enter the Wet N Wild giveaway! fridaygirltv", "Christoph Waltz wins the first award! He's the only nominee I cared about. He deserved it! Golden Globes", "And worst dressed goes to Halle Berry Golden Globes", "goldenglobes i am so incredibly happy for jessica chastain winning that i forgive all other disapointments and the overlong commercials!", "The best journeys are always shared.", "Eva Longoria's definitely has the best dress at the Golden Globes In Love", "Ang Lee has been nominated for directing the Life of Pi. That's what I'm gonna call the 6 weeks after I get out this dress", "So are people going to give credit to Matt Damon on this one too? goldenglobes", "them each film had an incredible cast and crew and I am so happy for Anne, Hugh, and Ben! All well deserved awards tonight. Golden Globes", "Who do you think was best dressed at tonights Golden Globes?", "Who do you guys think is best dressed at the Golden Globes tonight????", "Amy Poehler pops up in the Golden Globes crowd as a red-headed, big-teethed nominee, to the crowd's enjoyment:", "fiddlecub I only cared about the Golden Globes when it was hosted by rickygervais", "Golden Globes; overly pampered, overpaid, barely working, rich people giving themselves a pat on the back. Golden Globes Red Carpet", "I Will Not Diet Gyno Star Knowing their humor, I would hope so. But maybe I'm giving people way too much credit. fem 2 Golden Globes", "tmagazine: kerry washington and julianne are looking flawless. best of the night. goldenglobes redcarpet", "Golden Globes announcer dude butchered the pronunciation of Les Miserables during the original song nominees.", "My vote for best dressed, due to the awesomeness of an orange bow tie goldenglobes", "And we've reached the point where everyone thinks the hosts are fired/missing Did Amy and Tina go home? goldenglobes", ". World Mc Queen has the best dresses so far E Red Carpet Red Carpet Golden Globes", "the golden globes are as predictable as ever. Oscar will be the same and also the SAG awards... It's why I don't watch any of them. Boredom", "\" wmag: YES! REDHEADS ARE GOOD More redhead love at the Golden Globes--Brave wins best animated. cc: Wmag Will\"", "Perez Hilton: Kate Hudson was also one of my best dressed at the Golden Globes!!!", "Jodie Foster was honored tonight at the Golden Globes and took home the Cecil B. De Mille Award (which I've never...", "Who do you think is the best dressed at tonight's Golden Globes?", "victor garber's purple bow tie won best dressed in my opinion tonight. goldenglobes", "Don't get new wrong..... I LOVE Adele, but I feel like I've seen her in the same dress for every awards show blackandboring Golden Globes", "Couldn't care less about who wins Golden Globes, but so very happy to see Ben Affleck honored. Humble, talented, steward of the planet.", "Watching e's red carpet and with my eyes closed Kelly's cohost does not look how he sounds goldenglobes", "Golden Globes fashion: Best Actress nominee Jennifer Lawrence wears red Dior, Jessica Chastain pale blue", "First time I've actually been moved by one of these awards. So honest and genuine. Incredible. Golden Globes", "I was getting ready to throw a fit if Anne Hathaway didn't win this award Golden Globes", "\" Jenelle Hamilton: J-Lo's dress is giving me a hint of \"figure skater\". Not feeling it. Golden Globes\" ditto. Just add bling", "Who's best dressed at the goldenglobes? So much great fashion!", "Ha! Have they given out the Sarah Siddons award yet? Golden Globes Bette Davis", "1st contender for best dressed - Julianna Marguelies. dress jealousy. Golden Globes Red Carpet", "Jessica Alba has the best dress, and Katharine Mc Phee has the prettiest makeup. Golden Globes", "It's too hard to choose the best Golden Globes dress. Too many stunners! However, Lucy Liu looks like a princess!", "Her dress might be a miss but her acting is always a hit. J. Lawrence wins best actress for 'Silver Lining Playbook' Golden Globes", "Retweet if you are you watching the Golden Globes! Who's got the best redcarpet look?", "Lucy Liu and Debra Messing presenting. I think I've had this dream before. goldenglobes", "keithlaw The Golden Globes have long been rumored to be \"rigged\". Studios have been buying awards for years.", "Actor gives graceful credit to Tony Kushner, great playwright gone to film. Come back to the theater, Tony, we need you! Golden Globes", "Best dressed goes to: Darcy St. Fudge Golden Globes", "Anyone else watching the Golden Globes? Who do you think is best dressed? Tweet us! Golden Globe Jennif Lawrence", "Who did YOU think was best dressed on the red carpet at the Golden Globes? VOTE! via Katrina CM", "Halle Berry, Kate Hudson, Lucy Liu, Kerry Washington, and Salma Hayek get my vote for best dressed! Top 5 Golden Globes", "Get Into Geek: What a montage! Jodie Foster honoured with the Cecil B. De Mille award Golden Globes", "was gonna give best dressed to Bradley Cooper until Daniel Day Lewis stepped out looking mad fresh in that shawl collar tux. Golden Globes", "The HFPA evidently gave award to HOUSE OF LIES cause they figured it was about them. goldenglobes", "Okay Ben fine, you are forgiven for Daredevil, its finished you have redeemed yourself. Argo Golden Globes", "She's such a QUEEN! Can I please be her best friend? Look at that dress! SHEESH. Jennifer Lawrence SLP Golden Globes", "We've got to give all credits to Claire Danes. Her acting in Homeland is convincingly superb! Golden Globes", "\"Maggie Smith could not be....\" bothered. She just don't give a shit. Golden Globes", "This monologue is beyond incredible. Can Tina Fey and Amy Poehler host everything, please? goldenglobes", "Giuliana Rancic Julianne Hough was perfection! Favorite dress of the night! bestdressed E Red Carpet goldenglobes eonline Red Carpet Team", "Official Adele wins best song \"Skyfall\" a well deserved win! Golden Globes redcarpet", "I don't normally chat fashion during awards shows, but Kate Hudson's dress totally stole the show! Golden Globes Kate Hudson", "Ha! Have they given out the Sarah Siddons award yet? Golden Globes Bette Davis", "glamour fashion: Ladies and gents, we have our Golden Globes best dressed! Vote for your pick here:", "KE schmidty and I are hosting the Golden Globes next year... watch out world Getoffit", "The Critics' Choice Awards and the Golden Globes obviously share the same director. And obviously, my wish to have him fired wasn't granted.", "What I would give to have one hour in that room at the Golden Globes. So many incredible people to meet and yet I'm at home on my couch.", "Is Anne Hathaway's Chanel look her best so far? Decide for yourself: goldenglobes eredcarpet", "I'm LOVING amypoehler's first red presenting dress. Want it. Golden Globes puffsleevesforlife clevercleavage", "Burberry excellent gowns, go Team UK!! bestdressed adele goldenglobes", "I missed the golden globes ugh ... Guess ill be watching E fashion worst & best dressed", "World Mc Queen: Nicole Kidman wearing an Alexander Mc Queen SS 13 Golden Globes", "I nominate the lady rocking the turban for Golden Globes best dressed. Fierce mama!", "Checking out the fashion from E Red Carpet for the Golden Globes. My fav best dressed men-George Clooney,Ben Affleck,Leonardo Di Caprio", "Your host Tina Fey gracing the red carpet earlier! Golden Globes", "Say what you will about the Golden Globes, but at least they stopped giving awards to Modern Family.", "The Golden Globes are a good predictor of who'll win the Oscar(r) especially for best director...So I'm betting big on Ben Affleck at the Oscars", "Soooo Eva Longoria is best dressed for me! Golden Globes \"", "She's nominated for a gong tonight, but is Anne Hathaway's Chanel couture dress award-worthy? goldenglobes", "Shanzie 25: Jessica Alba is my fav for best dressed on the Golden Globes", "If Jennifer Lawrence starts spinning around and her dress catches on fire she wins all the awards. Golden Globes", "Jennifer lopez & Eva longoria are my golden globes 2013 best dressed, they look insanely beautiful!", "How many times has Giuliana crowbarred in a mention of her fertility/children/surrogate so far? Golden Globes", "Fab! best dressed! RT tomandlorenzo Nicole Kidman in Alexander Mc Queen Golden Globes 2013 World Mc Queen", "Vera Wang Gang: Thrilled, honored and excited to have dressed Julia Louis-Dreyfus Official JLD for the Golden Globes 2nite! X Vera", "So I reviewed the Golden Globes red carpet online. Too many wrinkly dresses and a lot of massive frumpiness. bestdressed jenniferlawrence", "Golden Globes Jodie Foster receiving and award for an incredible Film Making Job.", "I am bored enough. I may actually watch the award show tonight... goldenglobes needadrink", "I'm so honored that Squirrels won so many Golden Globes tonight lol", "Chocolate, leaky boobs and push-up competitions: the best of Golden Globes red carpet", "My top 3 Golden Globes best dressed: Julianne Moore, Naomi Watts and Kerry Washington. Who made your list? goldenglobes", "Gotta give credit to where credit's due. J Lo looks snatched! I mean that in a good way. Golden Globes", "And now Taylor Swift is going to write a sad pretty song about the Golden Globe award who chose Adele over her..... Golden Globes", "Best I'm a bi-polar CIA agent who just had a baby in real life a month ago & am rocking this red dress goes to Claire Danes. goldenglobes", "Watching tonight's Golden Globes? Check out more than 80 photos of the best, and worst, of the red carpet.", "Jennifer Lawrence is my pick for best dressed at the Golden Globes. Make your picks in eonline's Pose-Off! eredcarpet", "My fav tonight: Anne Hathaway in Chanel bestdressed Golden Globes", "Now that she's done presenting, maybe Kristen Wiig can go find the missing part of her dress. Golden Globes", "Ok I'm turning in early, photo shoot tomorrow and I need to get better! Congrats to all that won and were honored tonight goldenglobes", "A nominee for Best Motion Picture for A Comedy and Musical for Tonight's 70th Golden Globes is Les Miserables, Jake's prediction to win!", "?Quien fue la mejor vestida de la noche? *** who was bestdressed at the goldenglobes? redcarpet alfombra", "If this is going to be the Year of Weird Midriff Cutouts, I'm just going to give up and dress like Diane Keaton Golden Globes", "Nathangadrian: Huge thanks goes to tommyhilfiger for dressing Ricky Berens and I so well for the golden globes! Pics please!!", "Shock! Argo wins Golden Globes Best Picture by Foreign Press. Speech honored troops, but cut off due to time constraint.", "Nicole Kidman is my best dressed so far. goldenglobes", "Julianne Hough is definitely 1 best dressed at the Golden Globes", "Ok. So who is YOUR pick for best dressed? Kerry Washington gets my vote, with Julianne Moore as a close second. goldenglobes", "awww, bradley, you will always be my best actor. Bradley Cooper goldenglobes congrats Hugh Jackman - he is incredible too:)", "My favorites for best dressed at the golden globes 2013", "Why are Jessica Alba and Taylor Swift at the goldenglobes? They have no talent compared to any of the nominees in that room. foul", "Jennifer Lawrence in beautiful red Dior Houte Couture dress, can't get enough, stunning! goldenglobes bestdressed redcarpet fashion", "Yea man I def need to watch it haha bestactress in a TV series homeland clairedanes goldenglobes", "d'jango unchained was incredible. and mr. waltz deserves every accolade he receives. bravo. goldenglobes", "I can't wait to see who got worst and best dress goldenglobes.", "Jennifer Lopez' look is less of a dress and more of a delicate Thanksgiving table cover. Golden Globes", "I enjoy the red carpet much better than the actual awards ceremony so I will watch tomorrow on the DVR. goldenglobes", "Jlo is the best undress so far. Golden Globes", "Women that inspired, blah, blah, HBO is awesome, blah, blah, blah, best friend, blah, blah, emotions, meaningful", "So far Tina Fey wins best dressed. I'm obsessed with that dress. goldenglobes", "And that's a wrap folks! Who made it on your best and worst dressed lists? Read it all on i Village Canada Golden Globes", "The waiter who was supposed to deliver Quentin Tarantino's screwdriver wandered onstage, is presenting w/ Jessica Alba at the Golden Globes.", "Was not feeling Jodie Foster's speech at all...then she thanked & honored her mother with dementia. Now I'm in tears. Golden Globes", "Michelle Dockery is my best dressed of the night. Hands down. goldenglobes ladymary", "Eva Longoria has my vote for best dressed! You go girl!! goldenglobes", "I refused to get my flu shot today just to watch the Golden Globes tonight. Sorry for not wanting to miss who's wearing the best dresses.", "This year's prom queen: Jodie Foster honored for incredible contribution to cinema Golden Globes", "Yeah ok I'll give it to J Law-- I did like her in that movie. And she looks great and classic in that red number Golden Globes", "Are you watching the Golden Globes? Who is the best dressed of the night?", "Ann Hathaway, Nicole Kidman and Selma Hayek are my best dressed Golden Globes eredcarpet fashionpolice", "Ya'll did you see taylorswift 13 giving Amy a condescending look in her red-head getup? Bite me, T Swift. goldenglobes", "Haha. Absolutely. Budge should totally get an award for this.... bluecarpet goldenglobes", "realjenniferlopez did it again! jlo goldenglobes redcarpet bestdressed Fashion Style ig Style ig Fash", "Golden Globes Erica Red Carpet Dustin Hoffman wins best personality on the red carpet tonight. He is a presenter & His movie opens jan 25th", "Dear Golden Globes, you should have hired a cameraman who would just follow Taylor everywhere and give us the link. Sincerely, Swifties", "My vote for best dressed at the Golden Globes...Jennifer Garner. flawless", "Ann give that dress back to Meryl. Golden Globes", "No best picture for Django= no credibility for the Golden Globes.", "goldenglobes msleamichele the best dressed .... =)", "Who was YOUR best dressed? omg Insider goldenglobes", "Julianne Moore RT Huff Post Style Who's your best dressed so far? goldenglobes", "Jessica Alba is by far one of my best dressed of the night so far. Who are some of your best dressed? Golden Globes", "If they were giving out awards for best in outfit, J Lo would always win!!! SO SEXY! Golden Globes", "msleamichele looks stunning in her gown! Golden Globes bestdressed", "Kate Hudson's dress has to be the best so far! goldenglobes", "ilove Fireangel Amy Adams and Anne Hathaway are my best dressed for goldenglobes", "The life of a parent, realizing the only category you have scene the most nominations in are featured animated films on golden globes.", "Gosh, there are so many great looks tonight. Probably the best red carpet I've ever seen. Golden Globes", "Lucy lui's dress. Hands down the best goldenglobes", "The gang goes to Tim Whatley's Golden Globes party. Kramer has a gift for predicting award shows. George tries to exploit it for a bet.", "Mark Wahlberg's Hot Golden Globes Date? Diddy, Of Course: He may not have scored another award for 'Boardwalk Empire,' but W...", "I can't wait to accept my award at the golden globes from Hilary Duff. This has truly been a dream come true for me. honored", "What? The best thing about Les Mix was the ending; which I couldn't get to because I was bored w/ the first 30 minutes of it. Golden Globes", "fortunefunny: Let's give an award to Eva Longoria for dressing slutty. Golden Globes", "Kate Hudson in Mc Queen at the Golden Globes bestdressed goldenglobes mcqueen", "\"Really this award is about Tony Mendez.\" Ben Affleck on the real life CIA agent who inspired Argo. Golden Globes", "That's an ugly fucking dress.", "It's SHOWTIME! Tweet the JPR girls and let us know who was on your best dressed list. goldenglobes eonline Golden Globes E Red Carpet", "Haha. Absolutely. Budge should totally get an award for this.... bluecarpet goldenglobes", "And the fashion credit goes to Tommy Hilfiger! Nathangadrian and Ricky Berens killed it with their suits! Golden Globes -Jenny", "Who's watching the Golden Globes? Who gets your vote for best and worst dressed?", "I'm scared what Julia Roberts will do when she realizes she's not giving an award to Denzel. goldenglobes", "Rachel Weisz your dress aint right for these awards Golden Globes eredcarpet", "the best part of tonight's golden globes had to have been exibit A. Robert Downey Jr. & B. Jodie Foster's speech. inspired.", "Who was your pick for best dressed on the goldenglobes red carpet?", "Jacqueline M Wood Best Dressed: Ann Hathaway, Selma Hayek, Nicole Kidman, Emily Blunt Golden Globes bestdressed", "Who was on the best dressed list this year? How about the worst? Here's my thoughts!", "Lucy Liu is winning my best dress award as of right now. Beautiful!! Plus, I love her as a female Dr. Watson. Golden Globes Elementary", "Emily Blunt for best dressed at the Globes Golden Globes Fashion Police", "My best dressed of the night: Jodie Foster, her dress is very chic, I want it goldenglobes", "Yayyy \"django unchained\" my prediction is it will win most awards nominated for. quentintarantino Golden Globes", "shefinds: Who's on your best dressed list tweethearts? Golden Globes", "I heart John Hamm. He is the best dressed of the gents. goldenglobes eredcarpet", "Love this blue dress by Rosario but a ill daytime look for an award show. Don't think so fashion Golden Globes", "Seriously! Can we just give Dame Maggie a lifetime achievement award already & let somebody else win? TG Golden Globes", "Just realized how peaceful of an awards season this will be without K Stew on the carpet. Golden Globes", "Love Halle Berry on an awards carpet ! goldenglobes Stunning!", "The best and worst dressed at the Golden Globes!", "My picks for best dressed of the night! Michelle Dockery, Kerry Washington, & Nicole Kidman Golden Globes R", "goldenglobes best dressed: kate hudson in alexander mcqueen and worst dressed: halle berry in a candy wrapper from forever 21 goldenglobes", "The Week Jennifer Lawrence best dressed, hands down. She exudes class, smarts, and general badassery in everything she does. Golden Globes", "Mark Wahlberg's Hot Golden Globes Date? Diddy, Of Course: He may not have scored another award for 'Boa...", "So glad homeland is winning every award. Incredible show Golden Globes", "Jodie Foster gets honoured with Life time achievement award at the 70th Golden Globes", "Anne Hathaway, Jennifer Lawrence, Michelle Dockery, Adele & Jessica Alba are among our best dressed, how about you? goldenglobes", "Who would have predicted Christoph Waltz to win? This awards season is all over the place, and it's great. Golden Globes", "Okay... I'm loving Eva Longoria's dress. Aside from her leg, Don Cheadle makes is her best accessory on stage. goldenglobes", "I'm so scared everyone is going to drop their award. Golden Globes", "M Harris Perry Jodie Foster spoke truth to power tonight. So proud the industry FINALLY honored her! Golden Globes", "I wish I was famous so I could dress up and go to award shows. Golden Globes", "Who's your pick for best dressed at the Golden Globes? See my story on F", "bearblanca: Wow so many amazing dresses at the Golden Globes this year ...", "2013 Golden Globes Winners: TV And Movie Stars Honored At 70th Annual Ceremony: The best in TV and movies will b...", "1 NANCY ( 1 NANCY) jerrycferrara Adele wins best heist of her mothers drapes in lieu of a dress Golden Globes", "Kate Hudson and Alexander Gilbert were obviously the best dressed at the Golden Globes red carpet/after party tonight.", "Not to be outdone, Mitt Romney gives Tarantino an honorary Golden Globe for the dressage scene in DJANGO UNCHAINED Golden Globes", "Skyfall predictable but well-deserved. But between taylorswift 13 and Keith Urban country music was well represented! Golden Globes", "There should be awards for ad agency account people ... right ? JW Manfredi Golden Globes", "\"Girls\" wins best comedy! And they're playing Robin. So fitting. Golden Globes", "Madeline Malone: Best dressed of the night easily goes to Kate Hudson Golden Globes", "Michelle Dockery is my pick for best dressed at the Golden Globes. Make your picks in eonline's Pose-Off! eredcarpet", "Having a speech prepared when you win an award is just like a middle finger to the other nominees Golden Globes", "So far I am loving Lucy Liu's Carolina Herrera gown dramatic goldenglobes bestdressed", "Golden Globes nominee Jessica Chastain is ethereal in a custom Calvin Klein Collection seafoam halter dress:", "Anne Hathaway is best dressed!! No doubt..let's not even argue this one! goldenglobes", "Claire Danes, Anne Hathaway, Jennifer Lawrence, and all the best dressed at the 2013 Golden Globes", "I swear J Lo's dresses get more and more sheer each award show Golden Globes", "juliannehough tops my list of best dressed at every awards show! Love her style! Golden Globes People Globes", "It must be a brick-shitting experience to be up on stage for an award in front of hundreds. goldenglobes", "not many people can say I beat Meryl", "If you have a speech prepared at an award show that you didn't know you were gunna win at, you might be a cocky douche bag Golden Globes", "My prediction for best picture is Lincoln or Argo. I'm very torn between the two but I lean toward Lincoln. Beyond great movie Golden Globes", "\"There's Iron Man. She's Catwoman. He's Batman. There's Daredevil & Elektra. Wolverine just won an award...\"- me, watching the Golden Globes", "Golden Globes 2013 Red Carpet: The best dressed", "So the celebs get to eat while they sit for a 3 hour awards show. I might have pizza delivered. Same same right? Golden Globes", "My best dressed for the Golden Globes this year: Julianne Hough. Lucy Lui. Katherine Mc Phee. Kate Hudson. Taylor Bitch (I'll admit).", "Amy Adams snapped at the Golden Globes redcarpet with mariamenounos! globes hollywood bestdressed amya", "Nice to see hosts not doing tired \"I'm an asshole\" schitck donotmissrickygervais goldenglobes", "I can't actually bring myself to watch award shows...how are the Golden Globes? Did anyone dress like a swan this year?", "Incredible that the presenters are wearing more beautiful dresses than the nominees Golden Globes Fashionpolice", "best dressed on my list goes to: hayden, nicole kidman, and emily blunt. goldenglobes", "Can Kerry Washington be nominated for an Emmy for acting flattered that \"Fashion Police\" named her best dressed of the week? Golden Globes", "Why must J Lo wear these see-through dresses at awards show. Notafan Golden Globes", "The Golden Globes just awarded itself Best Television Miniseries, became a tesseract, disappeared into subspace.", "I vote for Amanda Seyfried for best dress at the Golden Globes. Goldenglobes", "Memo to all future Golden Globes hosts: You're fired. Please pack your belongings and see HR. Tina Amy", "I used sarcasm because compared to the other nominees Hathaway's performance was in another ballpark entirely. Golden Globes", "God I literally predict every winner of each award lol so happy Adele won that songs bomb Golden Globes", "Who is your best dressed? goldenglobes E Red Carpet", "Huge thanks goes to tommyhilfiger for dressing Ricky Berens and I so well for the golden globes!", "Kerry Washington boss. Fuck man I cant. Choose a best dressed yet Golden Globes", "OMG who was that lady callmemaybe bestdressed bradleycooper Golden Globes", "I wish Maggie Smith had sent Daisy to accept the award on her behalf. Golden Globes", "Hahaha oh my God, I love Fey-Poelher. Bombing the nominations with incredible fake teeth. Golden Globes", "Aaaaand the best animated feature is Brave! goldenglobes Another win for wild curly haired ladies!", "Oh yeah and I am going to be at the golden globes we'll see why. I'll give you a hint I'll be on the red carpet", "Lancome Ambassadress Julia Roberts looks stunning as she presents the best motion picture drama at the Golden Globes", "Jennifer Lopez for best dressed in Zuhair Murad at the golden globes. bestdressed jenniferlopez jlo go", "bitch speaking Anne Hathaway is perfect and I love her dress!!! Her award was well deserved! Les Mis was phenomenal!! Golden Globes", "Guess who is hired to host the Golden Globes next year?! Amy and Tina...killing it ladies!!! lovethem", "Who is hosting the awards this year? They have disappeared. Golden Globes", "I may be growing bored of goldenglobes Red carpet over. Now rich people who are thanking foreign people for giving them an award. yawn", "Jennifer Lopez' look is less of a dress and more of a delicate Thanksgiving table cover. Golden Globes", "Not the first time Bill Clinton appeared at the Golden Globes. He did a video presentation at 2005 show to thank all for Tsunami appeal", "Agreed!!!!RT smackdown 928: The way Hugh talks about his wife, so incredible and full of love bestguyaward freebiefive Golden Globes", "Dear Golden Globes, you should have hired a cameraman who would just follow Taylor everywhere and give us the link. Sincerely, Swifties", "Honestly didn't think others were allowed to win when John Williams is up for a composing award. And I preferred it that way. Golden Globes", "If I was Adele the last person I'd want to get my award from is JLO in that amazing dress! Golden Globes", "kerrywashington flawless dress and amazing movado vintage goldenglobes bestdressed", "I'm bored with people who mention their children whenever they win an award. Golden Globes", "See our best-dressed list from the Golden Globes! Who wore your favorite gown? Golden Globes Peony Events", "Racy & Lacy Jlo breath taking tonight my girl won best dressed hands down!!! Golden Globes", "Mark Wahlberg's Hot Golden Globes Date? Diddy, Of Course He may not have scored another award for 'Boardwalk Empire,' but Wahlberg tells", "Kate Hudson and Jessica Alba you gals win my best dressed. Stunning! Golden Globes", "15 best-dressed celebs on Golden Globes red carpet via todayshow BEST DRESSED TO ME.", "A gorgeous Claire Danes wins best actress in TV drama, rubs in her Golden Globes win at 15, wears dress hued in the blood of her peers.", "I think theterribomb and I should do award show video blogs in our sweat-outfits - Bravo Andy Bravo PR you'll want this!! Golden Globes", "Lea Michele is easily the best dressed person at the Golden Globes obsessed", "goldenglobes best dressed: kate hudson in alexander mcqueen and worst dressed: halle berry in a candy wrapper from forever 21 goldenglobes", "Kate Hudson was also one of my best dressed at the Golden Globes!!!", "Moody Vintage best dressed thoughts? goldenglobes", "Without a doubt J Lo had the best dress 2nite Golden Globes", "kerrywashington was definitely the best dressed of the night! Golden Globes", "And the award for cutest besties goes to Ben Affleck and George Clooney... Golden Globes Golden Globe Predictions loveit", "Anybody else find it incredibly awkward that J Lo is presenting an award after Ben's movie nomination...? goldenglobes", "I loved a lot of the dresses - but my 1 for best dressed: Jessica Alba. She took such a risk wearing a bright color! LOVE! Golden Globes", "i want jlo's dressssss!! goldenglobes bestdressed jlo", "Stars walk Red Carpet at Golden Globes: See who was the best and worst dressed at the Golden Globes. miami", "Only fitting that the winner of best score gets run off by the goldenglobes score...", "That was the best speech of the night so far goldenglobes redhead", "It's our hosts Tina Fey and Amy Poehler! goldenglobes redcarpet", "On Air With Ryan haydenpanettier is one of the best look of the day. eredcarpet Golden Globes", "I must be a little out of touch. I don't know most of these shows that are being honored on the Golden Globes.", "RT e QUI Ptweets Who are your best dressed stars from the Golden Globes? Emily Blunt in Michael Kors", "tina fey and amy poehler should host everything ever. they should host the world. redcarpet goldenglobes", "Watching the golden globes is giving me prom dress ideas", "HOW U DOIN auntie Wendy Williams!!!??? who do u think was best and worst dressed at the golden globes? goldenglobes", "Jennifer Lawrence, Taylor Swift, Marion Cotillard, Jessica Chastain, Emily Blunt & Anne Hathaway among our Golden Globes best dressed! You?", "Aren't the Golden Globes just kind of redundant? Why do we need multiple awards shows?", "think I'm going to call it... my bestdressed is Kate Hudson in Alexander Mc Queen Pre AW 13 Golden Globes", "\"Maggie Smith could not be....\" bothered. She just don't give a shit. Golden Globes", "Miss any of the awards? We've got you covered -- LIST of Golden Globes winners so far... Access Globes", "I want to go to an awards show so i can wear a fancy dress and get my hair and makeup done! :( Golden Globes", "I'm wondering who will crown as the best dress and worst dress tonyt! Golden Globes", "Yes! Brave wins best animated film. goredheads goldenglobes", "There's an award for that? Golden Globes Mexico credited as world leader in cutting pollution", "In honor of the Globes, we're giving away a $4,000 clutch filled w/ beauty goodies so you too can be red-carpet-ready!!", "And now, my old friend, Mandy Patinkin, and \"Homeland\" is honored at the Golden Globes.. Congratulations!!", "Drink whenever Maggie Smith wins award but can't be bothered to fly to the colonies to retrieve it. goldenglobes", "J Lo Sofia Vergara representing Latin women! They look gorgeous! goldenglobes bestdressed", "Anne Hathaway is giving her adorable speech, and then Eddie Redmayne appeared on the screen. Focus gone. goldenglobes", "Perez Hilton Kate Hudson was also one of my best dressed at the Golden Globes!!!", "We've narrowed it down to 4, now can you puloise finish off our bestdressed battle? Much obliged.", "Is it just me or does Hollywood really not get the irony of honoring Republicans and guns at the Golden Globes", "So, the Golden Globes are a terrible predictor of best director winners, right? goldenglobes", "Julianne Hough hands down best dressed Golden Globes", "Dreamy Sim 1 rplife justjared goldenglobes aww best ppl to hang out with.", "My top 3 Golden Globes best dressed: Naomi Watts,Kerry Washington and Taylor Swift. Who made your list? goldenglobes Ugo&Daver Red Carpet", "Selena is best dressed at the Golden Globes tonight.", "2013 Golden Globes Winners: TV And Movie Stars Honored At 70th Annual Ceremony: The best in TV and movies will b...", "Kate Hudson for best dressed at the Golden Globes.", "I missed the red carpet segment. Can anyone fill me on on the best legs and booty? Golden Globes", "Golden Globes wow. American presenters have had WAY too much redbull", "Have no clue who any of these people are, the shows or movies represented. Golden Globes Sheltered Life", "1 best dress of the night Kate Hudson in World Mc Queen goldenglobes", "kerrywashington kerry washington and julianne are looking flawless. best of the night. goldenglobes redcarpet", "Catherine Zeta Jones bestdressed Golden Globes", "How fitting that during an awards show, Target runs an ad reminding us how to screw in a lightbulb. Golden Globes", "Feeling so honored! It's amazing to receive an Golden Globe for \"Downton Abbey\"! It's so good to be a part of it all. Golden Globes", "This goldenglobes is the best I've ever seen. Well done Tina and Amy.", "Tonight are the Golden Globes! Who will be the best dressed? Will we see any fashions by FIDM Alumna Monique Lhuillier? Stay tuned!", "Julianne Moore and Marion Cotillard are my best-dressed. Kudos to Sofia Vergara for wearing Michael Cinco. Pinoy Pride Golden Globes", "zblay: Jodie Foster is giving not a single red velvet fucks tonight. Golden Globes", "vampirediaries where are you all tonight? I see no one representing you all at the Golden Globes!! Surely you all will be winners! ; )", "Only fitting that the winner of best score gets run off by the goldenglobes score...", "jessicaalba is hands down best dressed of the night Golden Globes", "Besides awards is there anything you collect?", "Julianne Moore representing Tom Ford. Best dressed of the night, hands down! goldenglobes", "The Golden Globes awards isn't on British TV, unless you count E! (sky 233) showing people on the red carpet. I don't.", "Jamie Dornan 1: Me on red carpet at Golden Globes. style", "I need Anne Hathaway to give my granny her dress back. Golden Globes", "goldenglobes best actress drama is jessica Chastain, who says bigelow has done more for women in cinema than she takes credit for.", "He may not have scored another award for 'Boardwalk Empire,' but Wahlberg tells MTV News he...", "(redacted) was unable to make it tonight so we accept the award on their behalf.", "Jennifer Lopez and Jason Statham are both consistently among the best-dressed at these award shows. Golden Globes", "Is Jessica mad because J Lo won best skin tight dress? goldenglobes", "SHOWTIME was honored with four goldenglobes this evening: the most series wins of ANY network & the most wins ever in our history!", "2013 Golden Globes Winners: TV And Movie Stars Honored At 70th Annual Ceremony: The best in TV and movies will b...", "Just remembered that I used to play with Sam Fox as a kid, and now he's giving awards at the Golden Globes and I'm at home on my laptop. lol", "Robert Verdi Anne Hathaway looked gorgeous!! Will be on EVERY best dressed list tmrw!!!! Anne Hathaway Golden Globes", "I wish my dad was an award-winning/nominated actor and I could go to events with him.... eredcarpet goldenglobes fashiongirlproblems", "Loving the dresses everyone is wearing at the Golden Globes even the presenters.", "mags doc we would do this RT: usweekly: Golden Globes hosts Fey, Poehler show off matching \"husband and wife\" outfits", "Don't call, text or tweet. The Golden Globes are on! eredcarpet was fantastic; now on to the awards.", "I think Giuliana Rancic knows she's NOT getting best dressed at Golden Globes", "fashion fashtag RT Thea Andrews Who was YOUR best dressed? omg Insider goldenglobes omginsider", "Did anyone ever design their dress & write an award acceptance speech when they were young? Yeah,me either.That would be dumb. goldenglobes", "cannot get enough of the goldenglobes eredcarpet. let awards season begin!!", "We definitely think Kerry Washington should win best dressed wearing Miu Miu Golden Globes", "The little red haired girl couldn't be here to accept the award, she was killed in horrible eraser accident. Golden Globes", "Still only like watching award shows for the dresses sojealous goldenglobes", "Miss Kelly O Another best dressed: Jennifer Garner. Stunning! goldenglobes fashionpolice", "robert downey jr. is now revered by awards shows. love it. goldenglobes", "Teen Vogue: Who do you think was best dressed at tonights Golden Globes?", "The redcarpet is kind of the best part... Golden Globes", "My best dressed for 2013 Golden Globes was Eva Longoria in Emilio Pucci Awards Gowns E Red Carpet", "To recap: red gowns, nude gowns, unusual busts, Kevin Dior and girl crushes on our comedienne hosts. goldenglobes", "mama naph: Wow evalongoria is gorgeous bestdressed Golden Globes", "2013 Golden Globes host predictions - Matt Pinfield and a canteloupe", "Final Tally: Argo wins big, Jodie goes long, Amy and Tina KILL, P Diddy just figured out these weren't the BET awards. goldenglobes", "Paging Joan Rivers! -> RT Huffington Post See all the best (and worst) red carpet dresses at the Golden Globes!", "Paul Rudd once again proves why he's the best and why the Tele Promp Ter guy is sooooo fired. Golden Globes", "I think Jennifer Garner is my pick for best dressed! gorgeous Golden Globes", "Tina Fey and Amy Poehler's character work as all of these presenters has been incredible Golden Globes", "If you can't count on J Lo for one thing ... It's that she will ALWAYS be best dressed at ANY award show ! Golden Globes", "First time golden globes has two hosts. Tina Fey and her scar. RBRGG", "Golden Globes GG I don't think JLO has ever been able to sit down in any dress she has worn at an award show basicinstinct", "Wow! Taylor Swift 13 has upped her game this awards season! She is sizzling in her dkny gown! goldenglobes eredcarpet", "goldenglobes liking the dresses of the hosts!", "goldenglobes: It's our hosts Tina Fey and Amy Poehler! goldenglobes redcarpet", "Guns dont kill people, red carpet award show coverage kills people.... Golden Globes", "Page Six: This year's prom queen: Jodie Foster honored for incredible contribution to cinema Golden Globes", "Ben Affleck was NOT nominated for an Oscar, incredible. Golden Globes", "Tina Fey looks fabulous hosting the Golden Globes in her teal green dress! She's workin her curves!", "Kerry will be presenting at TONIGHT's Golden Globes 8 ET/5 PT on NBC! Red carpet at 6 ET/3 PT Tune In! RT -kw's krew", "J Lo Eva Longoria msleamichele & Salma Hayek top our best dressed list Golden Globes", "My best-dressed: Stacy Kiebler. I know! My worst-dressed: Jennifer Lawrence and her crazy 50s/sci-fi breast parts. Golden Globes", "Jennifer Lawrence is definitely one of the best dressed. Golden Globes", "That's it for our Golden Globes coverage tonight! Check CF tomorrow AM for our full fashion recap complete with best-dressed picks!", "Jennifer Lawrence giving a wave on the red carpet Golden Globes", "Everyone was so excited that Bill Clinton presented 'Lincoln'. But I'm way more amped for Hillary to introduce Girls HBO. goldenglobes - KE", "Jlo is my best dressed nominee Golden Globes", "Lucy Liu representing for the Asians! Could of picked a better dress tho! Floral barf! Golden Globes", "I think that if you are not present to pick up your award then you forfit your award Golden Globes", "How weired that gay Jodie Foster has hater Mel Gibson as guest if honor on her table? Golden Globes", "I watch the presentation, critique the acts & outfits, see the win, and stare into the fridge during the acceptance speeches. goldenglobes", "Latinas stun on red carpet, presenting on stage at Golden Globes latism", "Mermaid dresses are trending at the Golden Globes tonight! Who looks the best?", "Less than 5 minutes away from the start of the Golden Globes. Who was the best dressed? Tell us your favorite!", "Everyone needs to stop pretending that the golden globes actually qualify as an award show. The nick kids choice awards has more cred.", "Photo: Eva Longoria is best dressed tonight! Hands down. Golden Globes", "The Award for Most Fired TV Production Person - goes to the one who forgot to load the teleprompter. goldenglobes", "Best dressed, best everything - ever, and the only part of Les Mis that I tolerated.", "louiseroe: My best dressed Golden Globes Jessica Alba, Nicole Richie, Nicole Kidman and Lucy Liu", "and also, everyone should be required to accept their award with an AMERICAN accent. this is confusing. USA Never Forget goldenglobes", "So far Nicole Kidman has my vote for best dress. Golden Globes", "Jessica Chastain's dress... please just give it to me. Golden Globes", "Golden Globes!!! Who's your best dressed tonight??", "Zooey Deschanel is my pick for best dressed at the Golden Globes. Make your picks in eonline's Pose-Off! eredcarpet", "\"They're not reality,\" says Christoph Waltz of award shows on the red carpet via nytimesmovies", "You remember when the guy who won best director met his wife on the set of Daredevil? goldenglobes", "award for most awkward commercials featured entirely too much tonight - target everyday collection. goldenglobes", "I think Quentin T is more honored to be sitting at Kerry Washington's table than to be winning this award tbh. Golden Globes", "Eh... Looks like I missed the red carpet, so I guess I'll wait and read the recap of the awards tomorrow. Golden Globes", "Prediction for best foreign film: Amour Golden Globes", "PHOTO SPECIAL: Claire Danes, Naomi Watts & more of our picks for the best dressed stars at the Golden Globes!", "Latinas stun on red carpet, presenting on stage at Golden Globes latism", "See what all the stars wore to the 2013 Golden Globes! Tell Us: Who was best and worst dressed?", "moffly media Who's your pick for best film tonight? ...and who do you think is best dressed? Golden Globes", "The celebrities all rocked the red carpet tonight. Women rule. goldenglobes always the best!", "ninagarcia: Julianne Moore is wearing my favorite look of the night goldenglobes", "Kate Hudson was also one of my best dressed at the Golden Globes!!!", "why is bill clinton at the golden globes i've never bothered to watch these awards is this normal", "Google News : Golden Globes: 'Les Miz' 'Argo' and 'Girls' win big; Jodie Foster honored - Chicago Tribune", "Eva Longoria has my vote for best dressed at the Golden Globes... Loved her dress!", "So who's your best dressed for the night? See the Cosmopolitan picks here:", "best dressed of the night at the Golden Globes goes to"]